constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       6500;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       6560;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          240;
        startFace       6620;
    }
    atmosphere
    {
        type            patch;
        nFaces          240;
        startFace       6860;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          800;
        startFace       7100;
    }
)

// ************************************************************************* //
