system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)       // 0 - Bottom-left-front
    (4 0 0)       // 1 - Bottom-right-front
    (4 1 0)       // 2 - Top-right-front
    (0 1 0)       // 3 - Top-left-front
    (0 0 0.1)     // 4 - Bottom-left-back
    (4 0 0.1)     // 5 - Bottom-right-back
    (4 1 0.1)     // 6 - Top-right-back
    (0 1 0.1)     // 7 - Top-left-back
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 10 6) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (1 2 6 5)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
